<a href="https://colab.research.google.com/github/parsa-abbasi/Data-Preparation-and-Visualization-in-Python/blob/main/numpy_job_offers_init.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# NumPy Exercise: Analyzing Job Offers
This notebook utilizes NumPy, a Python library for numerical computing, to perform analyses on a dataset containing information about job offers in the technology industry.

## üóÑÔ∏è Data
The dataset used in this notebook contains information about job offers in the technology industry. It includes the following four arrays:

* `job_titles`: an array of strings that represent different job titles offered in the industry.
* `salaries`: an array of strings that represent the salary ranges for the job offers. Each string contains two numbers separated by a hyphen, representing the minimum and maximum salaries, respectively.
* `companies`: an array of strings that represent the name of the companies offering the job positions.
* `years_of_experience`: an array of integers that represent the required years of experience for the job offers.

In [ ]:
import numpy as np

job_titles = np.array(['Data Analyst', 'Machine Learning Engineer',
                       'Data Analyst', 'Data Scientist',
                       'Data Scientist', 'Database Administrator',
                       'Database Administrator', 'Machine Learning Engineer',
                       'Data Scientist', 'Machine Learning Engineer',
                       'Data Analyst', 'Software Engineer',
                       'Back-End Developer', 'Data Analyst'])

salaries = np.array(['$78,500 - $102,000', '$130,000 - $190,000',
                     '$62,000 - $91,000', '$130,000 - $190,000',
                     '$165,000 - $240,000', '$85,000 - $120,000',
                     '$95,000 - $135,000', '$120,000 - $180,000',
                     '$123,000 - $220,000', '$190,000 - $240,000',
                     '$57,500 - $89,000', '$120,000 - $160,000',
                     '$110,000 - $145,000', '$70,000 - $110,000'])

companies = np.array(['Amazon', 'Apple',
                      'Walmart', 'Airbnb',
                      'Netflix', 'Microsoft',
                      'IBM', 'Tesla', 
                      'Microsoft', 'Google',
                      'Capital One', 'Facebook',
                      'Apple', 'JPMorgan Chase'])

years_of_experience = np.array([2, 3,
                                2, 5,
                                5, 5,
                                5, 5,
                                5, 5,
                                2, 3,
                                3, 3])

## üëî Finding the unique job titles

In [ ]:
# To-Do

## üë¥üèº Finding the average years of experience

In [ ]:
# To-Do

## üí∞ Calculating the average salary
As you can see, the average salary is in the format `$XX,XXX - $XX,XXX`. We need to convert this to a single number.   
We can do this by removing the `$` and `,` characters, splitting the string on the `-` character, converting the resulting strings to integers, and then taking the average of the two numbers.

In [ ]:
# To-Do

## üí∏ Finding the average salary for each job title

In [ ]:
# To-Do

## ü§ë Finding the highest offer

In [ ]:
# To-Do

Highest offer average salary:  215000.0

In [ ]:
# To-Do

Highest offer info:  ('Google', 'Machine Learning Engineer', '$190,000 - $240,000')

## üìä Sort the offers by average salary
We want to print the companies, job titles and salaries in ascending order of average salaries.

In [ ]:
# To-Do

## üëßüèº Finding all the offers with a required experience of 3 years or less
We want to print the companies, job titles, years of experience and average salaries for all the offers with less than 3 years of experience.

In [ ]:
# To-Do

## üì¶ Concatenate the arrays

Now let's combine all the information into a single array.
Each row will contain the company, job title, years of experience, salary range, and average salary.   
For example, the first row should be like this: `['Amazon' 'Data Analyst' '2' '$78,500 - $102,000' '90250.0']`

In [ ]:
# To-Do